Tekla.Structures.Drawing.TextResizeBehavior
Text resize behavior.

Tekla.Structures.Drawing.TextResizeBehavior.AllDirections
When the text is modified, resizing happens in all directions.
In this case, the insertion point will remain the same.

Tekla.Structures.Drawing.TextResizeBehavior.BottomRight
When the text is modified, resizing happens in bottom and right directions.
In this case, the insertion point will be modified.